---
kind: method
id: M:Autodesk.Revit.DB.Electrical.InsulationTypeSetIterator.#ctor
source: html/b8aaff2c-0e89-c187-4be8-0585943eedf8.htm
---
# Autodesk.Revit.DB.Electrical.InsulationTypeSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public InsulationTypeSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.